Revit 2026 API

# RebarCreateFromCurvesAndShape(Document, RebarShape, RebarBarType, Element, XYZ, IListCurve, BarTerminationsData) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Rebar CreateFromCurvesAndShape(
	Document doc,
	RebarShape rebarShape,
	RebarBarType barType,
	Element host,
	XYZ norm,
	IList<Curve> curves,
	BarTerminationsData barTerminationsData
)
```
```vb
Public Shared Function CreateFromCurvesAndShape (
	doc As Document,
	rebarShape As RebarShape,
	barType As RebarBarType,
	host As Element,
	norm As XYZ,
	curves As IList(Of Curve),
	barTerminationsData As BarTerminationsData
) As Rebar
```
```cpp
public:
static Rebar^ CreateFromCurvesAndShape(
	Document^ doc,
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	Element^ host,
	XYZ^ norm,
	IList<Curve^>^ curves,
	BarTerminationsData^ barTerminationsData
)
```
```fsharp
static member CreateFromCurvesAndShape :
        doc : Document *
        rebarShape : RebarShape *
        barType : RebarBarType *
        host : Element *
        norm : XYZ *
        curves : IList<Curve> *
        barTerminationsData : BarTerminationsData -> Rebar
```

#### Parameters

doc Document

rebarShape RebarShape

barType RebarBarType

host Element

norm XYZ

curves IListCurve

barTerminationsData BarTerminationsData

#### Return Value

Rebar

#### Reference

Rebar Class

CreateFromCurvesAndShape Overload

Autodesk.Revit.DB.Structure Namespace